YanYunNN/ai-passport/sdkconfig.defaults
# --- 目标芯片 ---
CONFIG_IDF_TARGET="esp32c3"
# 注:ESP32-C3 无 PSRAM,故不设 CONFIG_SPIRAM。

# --- Flash ---
# FoloToy AI Passport 的所有硬件批次均使用 8MB Flash。
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
# 烧录时按实际探测容量回写镜像头。
CONFIG_ESPTOOLPY_HEADER_FLASHSIZE_UPDATE=y
# 使用自定义后置 NVS 分区表：连续 all-in-one BIN 从 0x0 写入时不会覆盖 NVS。
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# --- 控制台:USB-Serial-JTAG(C3 原生 USB,GPIO18/19)---
# 不用 UART0:其默认 TX=GPIO21 与本板背光引脚冲突。
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y
CONFIG_ESP_CONSOLE_SECONDARY_NONE=y

# --- LVGL ---
CONFIG_LV_COLOR_DEPTH_16=y
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_20=y
# ui_font_noto_sc_14 由 lv_font_conv 默认 RLE 压缩生成，需由 LVGL 解压。
CONFIG_LV_USE_FONT_COMPRESSED=y
# 启用 LVGL 内置 Tiny JPEG 解码器，用于渲染后台推送的 240x320 JPEG 图片
CONFIG_LV_USE_TJPGD=y
CONFIG_LV_USE_FS_MEMFS=y
CONFIG_LV_FS_MEMFS_LETTER=77
# LVGL 内置 malloc 池大小(KB)。它是独立静态区、不与系统堆共享,配大了会白白占用 RAM。
# 本 demo UI 包含图片解码渲染, 32KB 足够。
CONFIG_LV_MEM_SIZE_KILOBYTES=32

# --- 系统 / 低功耗 ---
CONFIG_FREERTOS_HZ=1000
# 自动浅睡眠需要运行时 esp_pm_configure() 配合；见 main/power_manager.c。
CONFIG_PM_ENABLE=y
CONFIG_FREERTOS_USE_TICKLESS_IDLE=y
CONFIG_FREERTOS_IDLE_TIME_BEFORE_SLEEP=3
# 使 Wi-Fi modem sleep 时关闭 PHY 的 MAC/BB 域，RAM 开销约 2KB。
CONFIG_ESP_PHY_MAC_BB_PD=y
# 降低按键轮询的唤醒频率；仍可满足短按/长按交互。
CONFIG_BUTTON_PERIOD_TIME_MS=20
# 不启用 CONFIG_USJ_NO_AUTO_LS_ON_CONNECTION：悬空 D+/D- 噪声会持续阻止浅睡眠。

# --- Wi-Fi 企业认证(WPA2-Enterprise) ---
# 支持公司 WiFi 的"用户名+密码"PEAP/MSCHAPv2 认证；默认已开启,这里显式固化。
CONFIG_ESP_WIFI_ENTERPRISE_SUPPORT=y
# C3 无 PSRAM:企业认证连接期间释放动态缓冲,降低堆内存占用。
CONFIG_ESP_WIFI_ENT_FREE_DYNAMIC_BUFFER=y

# --- Kiro Passport Wi-Fi relay ---
# Passport uses a TLS-verified WSS client; the server certificate must validate
# against the ESP-IDF certificate bundle. This build persists enrollment
# credentials in NVS without encryption; production hardware should protect them at rest.
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE_DEFAULT_FULL=y
CONFIG_MBEDTLS_HARDWARE_MPI=n
CONFIG_MBEDTLS_DYNAMIC_BUFFER=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CONFIG_DATA=y
CONFIG_MBEDTLS_DYNAMIC_FREE_CA_CERT=y
CONFIG_MBEDTLS_SSL_IN_CONTENT_LEN=16384
CONFIG_MBEDTLS_SSL_OUT_CONTENT_LEN=4096


